### Задание 1

In [35]:
import pandas as pd
import numpy as np

In [36]:
data = ([1, 'Тургенев'], [2, 'Чехов'], [3, 'Островский'])
columns = ['author_id', 'author_name']
authors = pd.DataFrame(data = data, columns = columns)

In [37]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [38]:
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price':[450, 300, 350, 500, 450, 370, 290]})

In [39]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [40]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'inner')

In [41]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [42]:
top5 = authors_price.copy()

In [43]:
tp5 = top5.sort_values(by = 'price', inplace = True)

In [44]:
top5.tail(5)

   author_id author_name         book_title  price
2          1    Тургенев  Дворянское гнездо    350
5          3  Островский              Гроза    370
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
3          2       Чехов   Толстый и тонкий    500

### Задание 4

In [45]:
authors_stat = authors_price.groupby('author_name')['price']

In [46]:
authors_stat.describe()

             count        mean        std    min    25%    50%    75%    max
author_name
Островский     2.0  330.000000  56.568542  290.0  310.0  330.0  350.0  370.0
Тургенев       3.0  366.666667  76.376262  300.0  325.0  350.0  400.0  450.0
Чехов          2.0  475.000000  35.355339  450.0  462.5  475.0  487.5  500.0

In [47]:
authors_stat.aggregate([min, max, np.mean]).rename(columns = {'min':'min_price', 'max':'max_price', 'mean':'mean_price'})

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

### Задание 5

In [49]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [50]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [51]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [55]:
book_info = pd.pivot_table(authors_price, values = ['price'], index = ['author_name'], columns = ['cover'], aggfunc=np.sum, fill_value=0)

In [56]:
book_info

             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950

In [57]:
book_info.to_pickle("book_info.pkl")

In [58]:
book_info2 = pd.read_pickle("book_info.pkl")

In [59]:
book_info2

             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950